{
  "Mainnet": "The primary blockchain network where real transactions occur using real assets.",
  "Mining": "Using computers to solve problems that validate transactions and secure a blockchain.",
  "Mint": "The process of creating new digital tokens or NFTs on a blockchain.",
  "NFT": "A Non-Fungible Token is a unique digital item, like art or a collectible, stored on a blockchain.",
  "Nonce": "A random number used once in mining to find a valid blockchain block.",
  "Optimism": "A layer-2 blockchain that helps Ethereum run faster and cheaper using rollups.",
  "P2E": "Play-to-Earn games reward players with tokens or assets that can be traded or sold.",
  "Palm": "A blockchain built for low-cost NFTs and eco-friendly transactions.",
  "PFP": "Profile Picture NFTs like CryptoPunks or Bored Apes used as avatars.",
  "Polygon": "An Ethereum helper chain that makes transactions cheaper and faster.",
  "Post-State": "The state of the blockchain or smart contract after a transaction finishes.",
  "Private Key": "A secret code that gives access to your crypto wallet. Keep it private!",
  "Proof-of-Authority": "A system where trusted people are picked to keep the blockchain running.",
  "Proof-of-History": "A way to prove time and order of events on a blockchain, used by Solana.",
  "Proof-of-Stake": "A system where people lock coins to help run the blockchain and earn rewards.",
  "Proof-of-Work": "A system where computers compete to solve problems and earn coins.",
  "Public Key": "A public code tied to your wallet. People use it to send you crypto.",
  "RPC Node": "A server that lets apps talk to a blockchain and fetch data.",
  "Satoshi": "The smallest piece of Bitcoin, equal to 0.00000001 BTC.",
  "Seed Phrase": "A list of words that lets you recover your crypto wallet. Store it safely.",
  "Sharding": "Breaking a blockchain into pieces to help it process more transactions faster.",
  "Signing": "Using your wallet to approve actions or prove identity without giving away your password.",
  "Smart Contract": "Code that runs on a blockchain and follows preset rules automatically.",
  "Solana": "A fast and cheap blockchain used for apps, tokens, and NFTs.",
  "Solidity": "A coding language used to build smart contracts on Ethereum.",
  "SPL Token": "A token built for the Solana blockchain, like Ethereum’s ERC-20.",
  "Staking": "Locking tokens to help secure a network and earn more tokens in return.",
  "Stream": "Live blockchain data sent from on-chain events, like new transfers or mints.",
  "Testnet": "A practice blockchain where developers can test without using real money.",
  "Throughput": "The number of things a blockchain can handle per second, like transactions.",
  "Token": "A digital item that has value or purpose on a blockchain, like money or points.",
  "TPS": "Transactions Per Second – a speed measure for blockchains.",
  "Transaction": "An action on the blockchain, like sending coins or minting NFTs.",
  "TVL": "Total Value Locked – shows how much money is held in a DeFi app.",
  "Type 0 Transaction": "Old Ethereum transaction style before the 2021 upgrade.",
  "Type 2 Transaction": "Modern Ethereum transaction format with flexible gas fees.",
  "Unstoppable Domain": "A Web3 domain name like .crypto that links to your wallet.",
  "Validator": "A person or computer that checks transactions on a blockchain.",
  "Wallet": "An app or tool to hold and use your crypto and NFTs.",
  "Web3": "The next version of the internet, owned by users and powered by blockchains.",
  "Whale": "Someone who holds a huge amount of cryptocurrency and can move the market.",
  "Whitelist": "A special early-access list for sales, mints, or events on a blockchain project.",
  "Blockchain": "A shared digital ledger where all blockchain data is stored securely and publicly."
}